// 뮤탈리스크 - BOJ 12869 (해결못함)

#include <bits/stdc++.h>
using namespace std;
#define MAX 64

// SCV는 1개에서 3개까지 존재함. 
// 데미지 주는 순서는 [9,3,1]의 순열 3! = 6가지가 존재함.
// 3마리의 체력을 좌표로 생각하면 3차원 배열로 변환 가능함.

// 즉 이 문제는 3차원의 임의의 위치에서 [0,0,0]으로 가는 최단 거리를 구하는 것과 같음.
// 그래프에서 최단거리는 BFS방식으로 구함.
// 좌표 이동은 기존 2차원에서 4방향 탐색에서 했듯이, 6방향 탐색이라고 생각하면 됨.

// 기존 BFS와 마찬가지로, 이미 방문한 곳은 또 방문하면 안되므로 visited 배열이 필요함.

struct State {
    int a, b, c;
};

int N, visited[MAX][MAX][MAX], scv[3];

int damage[6][3] = {
    { 9, 3, 1},
    { 9, 1, 3},
    { 3, 9, 1},
    { 3, 1, 9},
    { 1, 3, 9},
    { 1, 9, 3}
};

int main() {

    cin >> N;
    for (int i=0; i<N; i++) {
        cin >> scv[i];
    }

    queue<State> q;
    q.push({scv[0], scv[1], scv[2]});
    visited[scv[0]][scv[1]][scv[2]] = 1;

    while (!q.empty()) {
        State cur = q.front();
        q.pop();

        if (cur.a == 0 && cur.b == 0 && cur.c == 0) {
            cout << visited[cur.a][cur.b][cur.c] - 1;
            return 0;
        }

        for (int i=0; i<6; i++) {
            // 음수 방지.
            int na = max(0, cur.a - damage[i][0]);
            int nb = max(0, cur.b - damage[i][1]);
            int nc = max(0, cur.c - damage[i][2]);

            if (!visited[na][nb][nc]) {
                visited[na][nb][nc] = visited[cur.a][cur.b][cur.c] + 1;
                q.push({na, nb, nc});
            }
        }
    }



    return 0;
}

// 뮤탈리스크 - BOJ 12869

// <핵심 아이디어>
//
// 1. SCV는 최대 3마리이므로
//    각각의 체력을 (a, b, c)라는 하나의 상태로 생각할 수 있음.
//
//    예)
//    SCV 체력 : 12, 10, 4
//    현재 상태 : (12, 10, 4)
//
// 2. 목표는 현재 상태에서 (0, 0, 0)까지
//    최소 몇 번의 공격으로 도달할 수 있는지 구하는 것.
//
//    -> 상태 간 최단거리 문제이므로 BFS 사용.
//
// 3. 한 번 공격할 때 9, 3, 1의 피해를 각각 한 번씩 줌.
//    3개의 데미지를 배치하는 경우는 3! = 6가지.
//
//    즉 하나의 상태에서 최대 6개의 다음 상태가 만들어짐.
//
// 4. 일반적인 2차원 BFS에서는
//
//       (y, x) -> 상/하/좌/우
//
//    로 다음 상태를 만들었다면,
//    이 문제에서는
//
//       (a, b, c)
//          ↓
//       6가지 데미지 조합
//
//    으로 다음 상태를 만듦.
//
// 5. visited[a][b][c]는
//    'SCV 체력이 각각 a, b, c인 상태'의 방문 여부와
//    해당 상태까지 필요한 공격 횟수를 저장함.
//
// 6. 공격 후 체력이 음수가 될 수 있으므로
//
//       max(0, 체력 - 데미지)
//
//    를 사용하여 최소 체력을 0으로 제한함.
//
// 7. SCV가 1~2마리인 경우 나머지 scv 배열 값은
//    전역 배열이므로 자동으로 0으로 초기화됨.
//    따라서 동일한 3차원 BFS를 그대로 사용할 수 있음.